// 1) კომენტარის სახიდ ვრცლად ახსენით რა არის DOM
        // არის მოდელი რომელიც აღწერს ვებ-გვერდის სტრუქტურას ისე რომ პროგრამებს მაგალითად JavaScript-ს შეეძლოს იმ ვებ-გვერდთან ურთიერთობა

// 2) რა განსხვავებაა let და const'ს შორის
        // let – ქმნის ცვლადს რომლის მნიშვნელობა მომავალში შეიძლება შეიცვალოს
        // const – ქმნის ცვლადს რომლის მნიშვნელობა ვერ შეიცვლება (უნდა მიენიჭოს მნიშვნელობა მხოლოდ ერთხელ)

// 3) შექმენით ღილაკი რომელზეც დაკლიკებისას მომხმარებელს გამოუტანს alert box'ს სადაც ეწერება "Hello User"
        function showMessage() {
            alert("Hello User");
        }
