# 1)შექმენით სია შემდგარი 10 ელემენტისგან, და გამოიტანეთ მხოლოდ კენტ ინდექსზე მდგომი ელემენტი

list = [1, 2, 3, 4, 5, 6, 7, 8, 9,]
for i in range(10):
    if i % 2 == 1:
        print(i)
   

# 2)შექმენით სია რომელიც შედგება 5 რიცხვისგან, გადაუარეთ ამ სიას for ციკლით და შეაჯამეთ თითოეული რიცხვი, ბოლოს გამოიტანეთ ამ რიცხვების ჯამი (დაგჭირდებათ ერთი დამატებითი დამთვლელი ცვლადი (ჯამის ცვლადი, რომელსაც თითოეული რიცხვი დაემატება ყოველ იტერაციაზე))

second_list = [243, 43 , 54, 6456, 23]
total = 0
for i in second_list:
    total += i
print(total)











# 3)შექმენით სია შემდგარი 10 რიცხვისგან, გადაურეთ for ციკლით, შეამოწმეთ კენტია თუ ლუწი, თუ ლუწია დაბეჭდეთ i, "luwia", თუ კენტია i, "kentia"
nums = [2, 4, 6, 8, 10, 3, 7, 1, 0]
for i in range(9):
    if i % 2 == 0:
        print("luwia")
    else:
        print("kentia")

