// 1) შექმენით ცვლადი dayNumber რომელშიც შეინახავთ 1-7მდე რიცხვს და გამოიტანთ მასთან ასოცირებულ კვირის დღეს. 1 - ორშაბათი 2 - სამშაბათი და ა.შ
let dayNumber = 3; 

switch(dayNumber) {
    case 1:
        console.log("ორშაბათი");
        break;
    case 2:
        console.log("სამშაბათი");
        break;
    case 3:
        console.log("ოთხშაბათი");
        break;
    case 4:
        console.log("ხუთშაბათი");
        break;
    case 5:
        console.log("პარასკევი");
        break;
    case 6:
        console.log("შაბათი");
        break;
    case 7:
        console.log("კვირა");
        break;
    default:
        console.log("არასწორი რიცხვი");
}


// 2) შექმენი score ცვლადი. თუ score მეტი არის 90ზე მაშინ გამოიტანე "perfect" თუ 60-ზე მეტი არის და 90ზე ნაკლები მაშინ გამოიტანეთ "decent" და სხვა შემთხვევაში გამოიტანეთ "fired😡😡😡"
let score = 85;

if (score > 90) {
    console.log("perfect");
} else if (score > 60 && score <= 90) {
    console.log("decent");
} else {
    console.log("fired");
}


// 3)შემქენით ცვლადი year სადაც შეიყვანთ რაღაც წელიწადს. შეამოწმე ეს წელი ნაკიანი წელია თუ არა.
let year = 2024;

if ((year % 4 === 0 && year % 100 !== 0) || (year % 400 === 0)) {
    console.log("ნაკიანი წელია");
} else {
    console.log("არ არის ნაკიანი წელი");
}


// 4) შექმენი number ცვლადი სადაც შეინახავთ რიცხვს და გამოიტანე 0 თუ რიცხვი ნულია თუ დადებითია და ლუწი გამოიტანე დადებითი ლუწი თუ დადებითია და კენტი  დადებითი კენტი თუ უარყოფითია უარყოფითი რიცხვი
let number = -4;

if (number === 0) {
    console.log("0");
} else if (number > 0 && number % 2 === 0) {
    console.log("დადებითი ლუწი");
} else if (number > 0 && number % 2 !== 0) {
    console.log("დადებითი კენტი");
} else {
    console.log("უარყოფითი რიცხვი");
}


// 5) შექმენი a, b, c ცვლადები და გამოიტანე რომელია ყველაზე დიდი. ისიც გაითვალისწინეთ რომ შეიძლება ყველა რიცხვი იყოს თანაბარი. Good luck（*＾-＾*）
let a = 10;
let b = 20;
let c = 20;

if (a === b && b === c) {
    console.log("ყველა რიცხვი ტოლია");
} else if (a >= b && a >= c) {
    console.log("ყველაზე დიდია a =", a);
} else if (b >= a && b >= c) {
    console.log("ყველაზე დიდია b =", b);
} else {
    console.log("ყველაზე დიდია c =", c);
}