# 2)შექმენით სია სადაც გექნებათ 5 ელემენტი და მინუს ინდექსების გამოყენებით გამოიტანეთ ბოლო 3 ელემენტი

list = ["nika", 23, "alexa", 4.4, 923]
print(list[-3:])

# 3)შექმენით სია სადაც გექნებათ 10 რიცხვი, გადაუარეთ ამ სიას და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია ან ტოლია 10ზე
nums = [1, 2, 3, 4, 5, 67, 34, 78, 13, 10]
for i in nums:
    if i >= 10:
        print(i)

# 4)კომენტარის სახით ახსენით რა არის ფუქნცია, რაში ვიყენებთ და ჩამოწერეთ ყველა ნასწავლი ფუნქცია (გვერდით მიუწერეთ მათი დანიშნულება)
#ჩვენ ვისწავლეთ upper ფუნქცია რომლის საშუალებითაც შეგვიძლია სტრინგი დიდად დავწეროთ EXAMPLE: name = nika
#                                                                                                print(name.upper())  



# 5)(***BOSS LEVEL***) მომხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შეეკითხეთ უნდა თუ არა რომ მისი გვარი გადაიყვანოს დიდ ასოებად, თუ გიპასუხათ "yes" მაშინ დაუბეჭდეთ მისი სახელი დიდი ასოებით, თუ გიპასუხათ "no" დაუბეჭდეთ უბრალოდ მისი სახელი. (მინიშნება: გაკვეთილის ბოლოს განვიხილეთ ზედაპირულად)

name = input("your name: ")
question = input("want your name in upper case? (yes or no): ")
if question == "yes":
    print(name.upper())
elif question == "no":
    print(name)
else:
    print("only yes or no")


