# 1)უყურეთ ჩანაწერს თავიდან

# 2)გაიარეთ რეგისტრაცია Sololearn.com-ზე (ჩანაწერის მიხედვით (თუ ვერგაიგეთ მიწერეთ რაზმის ლიდერს))


# 3)ისწავლეთ შემდეგი სიტყვები:

# variable = ცვლადი
# variable value = ცვლადის მნიშვნელობა
# parentheses - ფრჩხილები
# quotes - ბრჭყალები


# 3)გაიცანით თქვენი ჯგუფელები, დაიმეგობრეთ, და გაუზიარეთ შთაბეჭდილებები, იმეცადინეთ ერთად, შეიყვარეთ ერთმანეთი. 
# (ვისაც გაიცნობთ, ყველას სახელი და გვარი ამოიწერეთ პითონში და შეინახეთ ცვლადებში

# 4) ყოველ მეორე დღეს გააკეთეთ 100 Push-up, 200 პრესი, 100 squat



# 5) ჩაეხუტეთ მშობლებს, გადაუხადეთ მადლობა და გაუზიარეთ შთაბეჭდილებები. <3