// 1)მომხარებელს შემოატანინეთ ციფრი, შემდეი 0 იდან ამ რიცზვამდე დაპრინტეთ ყველა რიცხვი, დაიხმარეთ რესურები, გამოიყენეთ while loop (javascript) (NOT python)
let n = parseInt(prompt("შეიყვანეთ რიცხვი:"));

while (n >= 0) {
  console.log(n);
  n--;
}

// 2)მომხარებელს შემოატანინეთ სახელი, შემდეგ სანამ ამ სახელის სიგრძე ნაკლებია 10ზე, შემოატანინეთ ახლიდან 
// გამოიყენეთ while loop (javascript) (NOT python)
let name = prompt("შეიყვანეთ თქვენი სახელი:");

while (name.length < 10) {
  name = prompt("სახელი უნდა შეიცავდეს მინიმუმ 10 სიმბოლოს. შეიყვანეთ თავიდან:");
}

console.log("მადლობა! თქვენი სახელი: " + name);

// 3)მომხარებელს შემოატანინეთ პინკოდი, შემდეგ სანამ ეს პინკოდი არ უდრის 6446 ს, შემოატანინეთ ახლიდან
// გამოიყენეთ while loop (javascript) (NOT python)
let pin = prompt("შეიყვანეთ PIN კოდი:");

while (pin !== "6446") {
  pin = prompt("არასწორია. თავიდან სცადეთ PIN კოდის შეყვანა:");
}


// 4)მომხარებელს შემოატანინეთ პაროლი, სანამ ეს პაროლი არ უდრის "ვანოჩკა" ს, შემოატანინეთ ახლიდან
// გამოიყენეთ while loop (javascript) (NOT python)
let password = prompt("შეიყვანეთ პაროლი:");

while (password !== "ვანოჩკა") {
  password = prompt("არასწორი პაროლი. სცადეთ თავიდან:");
}




