# 1)შექმენით სია რომელშიც იქნება 5 სახელი შემდეგ, ამოიღეთ სიიდან პირველი და ბოლო ელემენტი
names = ["nika", "giorgi", "vano", "ilia", "saba"]
names.pop(0)
names.pop(3)
print(names)

# 2)კომეტარებით ახსენით რას აკეთებს თითოეული ფუნქცია:

# .insert() - ვამატებთ ელემენტს სიაში რომელ იდექზეც გვინდა
# .append() - ვამატებთ ელემენტს სიის ბოლოში
# .pop() - ვშლით ელემენტს რომელ ინდექსზეც გვინდა
# .len() - ვიგებთ სიის ან სტრინგის სიგრძეს

# 3) შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდით დაამატეთ ახალი სახელი სიის მეორე ინდექსზე
names2 = ["nika", "giorgi", "vano", "ilia", "saba"]
names2.insert(2, "jemali")
print(names2)

