# 1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით 
def multiply(num1, num2):
    return num1 * num2
print(multiply(2, 2))


# 2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.
# isalnum - თუ სრინგში არის რიცხვი ან ასო აბრუნებს True-ს
# isdigit - თუ სტრინგი შედგება მხოლოდ რიცხვებისგან აბრუნებს True-ს
# islower - თუ სტრინგი შედგება მხოლოდ პატარა ასოებისგან აბრუნებს True-ს
# isnumeric - ?
# isupper - თუ სტრინგი მხოლოდ დიდი ასოებისგან შედგება აბრუნებს True-ს
# count - ითვლის რამდენჯერ მეორდება ასო სტრინგში


# 3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები
# max - აბრუნებს მაქსიმალურ მნიშვნელობას
# min - აბრუნებს მინიმალურ მნიშვნელობას



