// 1) კომენტარების სახით ახსენით რა არის scope-ბი და რა სახის scope-ბი გვაქს

// Scope ნიშნავს ცვლადების ხილვადობის არეალს (სად არის ცვლადი ხელმისაწვდომი კოდში).

// არსებობს რამდენიმე ტიპის scope:

// 1. Global Scope (გლობალური scope)
// ცვლადი, რომელიც გამოცხადებულია ფუნქციის ან ბლოკის გარეთ,
// ხელმისაწვდომია მთელი პროგრამის მასშტაბით.

// 2. Function Scope (ფუნქციის scope)
// ცვლადი, რომელიც გამოცხადებულია ფუნქციის შიგნით,
// ხელმისაწვდომია მხოლოდ ამ ფუნქციის შიგნით.

// 3. Block Scope (ბლოკის scope)
// ცვლადი, რომელიც გამოცხადებულია {} ბლოკის შიგნით



// 2) კომენტარების სახით ახსენით თუ რა არის window ობიექტი და რა დანიშნულება აქვს საერთოდ, რისთვის შეგვიძლია გამოვიყენოთ?

//  window არის გლობალური ობიექტი
// ყველა გლობალური ცვლადი და ფუნქცია რეალურად window ობიექტის თვისებაა.



// 3) შექმენით გლობალური ცვლადი country და მიანიჭეთ მნიშვნელობა "Georgia". შემდეგ შექმენით კოდის ბლოკი, რომლის შიგნითაც let keyword-ით შექმნით იმავე სახელის ცვლადს (country) და მიანიჭებთ მნიშვნელობით "France".დაბეჭდეთ ცვლადი ბლოკის შიგნით და ბლოკის გარეთ. ახსენით, რატომ არ შეიცვალა გლობალური ცვლადის მნიშვნელობა.


let country = "Georgia";

{
    country = "France";
    console.log(country);
}

console.log(country);

// რატომ არ შეიცვალა გლობალური ცვლადი?
// რადგან let ქმნის ბლოკის scope-ს.
// ბლოკის შიგნით შექმნილი country არის სრულიად განსხვავებული ცვლადი,
// რომელიც მხოლოდ იმ ბლოკში არსებობს.
// გლობალურ ცვლადს არანაირი ცვლილება არ შეეხო.

