// 1) მომხმარებელს შემოატანინეთ რიცხვი და უთხარით ლუწია თუ კენტი.
let num = Number(prompt("შეიყვანე რიცხვი: "));
if (num % 2 > 0) {
    console.log("კენტია")
} else {
    console.log("ლუწია")
}


// 2) მაღაზიაში არის ფასდაკლება მხოლოდ არასრულწოვნებზე. არასრუწლოვანი ადამიანი მიიღებს 50%იან ფასდაკლებას
// ხოლო სრულწლოვანი გადაიხდის ჩვეულებრივ ფასს. მომხმარებელს შემოატანინე მისი წლოვანება და დაწერეთ პროგრამა რომელიც ადამიანს ეტყვის მან მიიღო თუ არა ფასდაკლება.
let age = Number(prompt("შეიყვანე ასაკი: "))
if (age < 18) {
    console.log("შენ მიიღე 50%იანი ფასდაკლება")
} else {
    console.log("შენ ვერ მიიღე 50%იანი ფასდაკლება")
}


// 3) მაღაზიაში არის ფასდაკლება მხოლოდ არასრულწოვნებზე და 18 წლის ხალხზე. არასრუწლოვანი ადამიანი მიიღებს 50%იან ფასდაკლებას, 18 წლის ადამიანი მიიღებს 25% ფასდაკლებას,
//  ხოლო სრულწლოვანი გადაიხდის ჩვეულებრივ ფასს. მომხმარებელს შემოატანინეთ მისი ასაკი და დაწერეთ პროგრამა რომელიც ადამიანს ეტყვის მან მიიღო თუ არა ფასდაკლება და თუ მიიღო რამდენი.
let ag = Number(prompt("შეიყვანე ასაკი: "))
if (ag < 18) {
    console.log("შენ მიიღე 50%იანი ფასდაკლება")
} else if (ag = 18) {
    console.log("შენ მიიღე 25%იანი ფასდაკლება")
} else {
    console.log("შენ ვერ მიიღე 50%იანი ფასდაკლება")
}


