// 2) კომენტარის სახით სრულყოფილად ჩამოაყალიბეთ რა არის scope JavaScript'ში.
// scope- ნიშნავს ხილვადობის ზონას, სადაც ცვლადი ხელმისაწვდომია. JavaScript-ში სქოუფი განსაზღვრავს, სად და როგორ შეგვიძლია ცვლადების წვდომა. არსებობს რამდენიმე


// 3) დაბეჭდეთ 100'ის ფარგლებში რენდომული რიცხვი.
// console.log(Math.floor(Math.random() * 100));

// 4) შექმენით ცვლადი სადაც შეიახავთ 5'ის ფარგლებში რენდომ რიცხვს,ეს რიცხვი დაამრგვალეთ "ზემოთ" და შემდეგ გამოიტანეთ ამ რიცხვის კვადრატი.
let num = Math.ceil(Math.random() * 5);
console.log(num ** 2);


