// 1) შექმენით ცვლადი სამივე keyword-ის გამოყენებით(var, let, const).

// დაახასიათედ კომენტარებით თითეული keyword-ი.

// თქვენს მიერ შექმნილი ცვლადები შეცვალეთ(სამივე მათგანი) და ახსენით რაატომ გამოიტანა შეცდომა const-ით შექმნილ ცვლადზე

    var age = 14;  // ძველი ტიპის ცვლადი
    age = 15 ;

    let namee = "Nika"; // თანამედროვე ცვლადი
    namee = "Giorgi";

    const lastName = "Megrelishvili"; // მუდმივი ცვლადი მნიშვნელობის შეცვლა არ შეგვიძლია
    // const-ის შეცვლა არ შეგვიძლია


// 2) შექმენით ცვლადი რომელსაც მინიმუმ 3 სიტყვისგან ექნება სახელი. გამოიყენეთ camelCase-ი
    let goaIsTheBest = true 


// 3) კომენტარებით ახსენით რისთვის გამოიყენება typeof ოპერატორი და შეასრულეთ მისი გამოყენებით რამოდენიმე მაგალითი.
    // typeof გამოიყენება მნიშვნელობის ტიპის გასაგებად

    console.log(typeof age) // "number"
    console.log(typeof namee) // "string"



