console.log(myArr.toString()) // გარდაქმნის მთელს თაიგულ ელემენტებს ერთ სტრინგად

console.log(myArr.at(1)) // საბმში მდებარე ინდექსზე მყოფი ელემენტი გამოიტანს

console.log(myArr.join("#")) // გადააქცევს მთელ სიის ელემენტებს რამის ჩასმის იმიტო დაბეჭდავს ყველა ელემენტს სტრინგში

myArr.push("Georgia") // სიის ბოლო პოზიციაზე append ბული მნიშვნელობა დაემატება ბოლოს

console.log(myArr)

myArr.pop() // ბოლოელემენტი სიის ბოლოდან მოიხსნება

myArr.shift() // სიის ელემენტს ამოიღებს თავიდან
myArr.unshift(1) // სიის დასაწყისში ელემენტზე დაამატებს ელემენტს

delete myArr[1] // წაშლის ინდექსზე მყოფ ელემენტს თუმცა და მის მაგივრად ჩაწერს undefined ს

let resultArr = myArr.concat(myArr1) //ორივე სიის ერთიანობას ქმნის შედეგად, ანუ აერთებს ახალ სიას
console.log(resultArr)
let nums = [1, 2, 3, 4, 5, 6, 7, 8]

console.log(nums.slice(1, 7)) // იღებს რას თაიგულის slicing უნარით ანუ მოიჭრა და განსახვავებული სტრინგი