// 1) შექმენით რიცხვების სია და ამ სიიდან გამოიტანეთ მაქსიმალური და მინიმალური მნიშვნელობები
console.log(Math.max(...[100, 200, 300, 400, 500, 50]))
console.log(Math.min(...[123, 432, 643, 124, 342, 10]))

// 2) შემთხვევითობის პრინციპით 10'ის ფარგლებში გამოიტანეთ რიცხვი შემდეგ კი დაამრგვალეთ 
console.log(Math.round(Math.trunc(Math.random() * 10)))

// 3) აიღეთ ნებისმიერი უარყოფითი რიცხვი და გადაიყვანეთ დადებითში
console.log(Math.abs(-100))

// 4) შექმენით ცვლადი სადაც შეინახავთ ათწილად რიცხვს შემდეგ ეს რიცხვი დაამრგვალეთ ჯერ მაღლა შემდეგ კი დაბლა.
let num = 7.3;
let ceil = Math.ceil(num)
let floor = Math.floor(num)

// 5) შექმენით ცვლადი, გადადაეცით რაღაც რიცხვი და დაბეჭდეთ იგი მე-4 ხარისხში. 
let number = 2;
let power = Math.pow(pow, 4);
console.log(power)

// 6) შექმენით ცვლადი მასში შეინახეთ ათწილადი რიცხვი და დაამრგვალეთ ისე როგორც მათემატიკაში მრგვალდება
let numb = 10.34
console.log(Math.round(numb))

